wip = "🚧 Ещё в разработке 🚧"
error = '''Печаль беда огорчение 🐼 Вы не должны были увидеть это сообщение, но оно есть. 
Это значит в боте что-то поломалось 🙈
Напишите пожалуйста об этом в закрытый чат жильцов и сообщите:
{}'''
unsuccessful = "Не получилось 🐼"
success = "Успешно 👍"
register_by_number = "Указать номер квартиры"
register_by_entr_and_floor = "Регистрация по парадной и этажу"
register_commerce = "Регистрация от лица компании"
register_commerce_im_shure = "✅ Ввести название компании"
reregister_by_number = "Указать номер квартиры"
register_by_number_confirm = "✅ подтверждаю: {}"
register_by_number_cancel = "⛔️ ошибка в номере"
register_by_number_reinput = "Возможно вы ошиблись в вводе номера. Введите только номер квартиры ЖК Халькон одним числом :)"
welcome_first = '''Здравствуйте! Мы ещё не знакомы 🙈 поэтому набор доступных действий сильно ограничен 🐼

Если вы собственник или живёте в ЖК Халькон - используйте "{}"
Если вы являетесь представителем компании связанной нашим ЖК - нажимайте "{}"

⚠️Изменить номер квартиры или название компании после регистрации невозможно ⚠️

Доступные действия ⤵️'''.format(register_by_number, register_commerce)
welcome_flat = "👋 Вы указали квартиру №{}. Доступные действия ⤵️"
welcome_commerce = '👋 Вы указали компанию "{}". Доступные действия ⤵️'
close_chat_link = "Перейти в закрытый чат жильцов 💬"
make_post = "Дать объявление в @Halkon_SPb 📰"
todo_for_bot = "Улучшение бота 💡"
get_floor_neighbors = "Контакты соседей на этаже ↔️"
get_up_neighbors = "Контакты соседей этажом выше ⬆️"
get_down_neighbors = "Контакты соседей этажом ниже ⬇️"
get_entrance_neighbors = "Контакты соседей по парадной"
get_all_neighbors = "Контакты всех соседей"
get_house_commerce = "Контакты коммерции в доме"
neighbors_not_found = "Контакты не найдены 🐼"
get_yk_contact = "Контакт УК"
main_menu = "Назад"
statistics = "Сколько нас? 👀"
register_approve = "Добавить жильца"  #/подтвердить
register_cancel = "Удалить жильца"
new_neighbor = 'Новый сосед! 🎉\n<span class="tg-spoiler">ID {}</span>{}'
new_commerce = 'В боте зарегестрировался новый представитель компании <span class="tg-spoiler">ID {}</span>'
choose_register_way_confirm = '''Для регистрации/подтверждения другого человека необходимо:
- либо переслать любое сообщение от этого человека;
- либо написать его Telegram ID (указывается в сообщении от бота в виде размытого текста).
Если не получается - напишите "нет"'''
#register_approve_confirm = "✅ продолжаем"
#register_approve_by_message = ""
