wip = "🚧 Ещё в разработке 🚧"
error = '''Печаль беда огорчение 🐼 Вы не должны были увидеть это сообщение, но оно есть. 
Это значит в боте что-то поломалось 🙈
Напишите пожалуйста об этом в закрытый чат жильцов и сообщите:
{}'''
register_by_number = "Регистрация по номеру квартиры"
register_by_entr_and_floor = "Регистрация по парадной и этажу"
reregister_by_number = "Указать номер квартиры"
register_by_number_check = "Ваша квартира №{}, верно? ⤵️"
register_by_number_confirm = "✅ подтверждаю: {}"
register_by_number_cancel = "⛔️ ошибка в номере. Назад"
register_by_number_reinput = "Возможно вы ошиблись в вводе номера. Введите только номер квартиры ЖК Халькон одним числом :)"
welcome_first = '''Здравствуйте! 
Для поиска соседей нужно зарегистрироваться по номеру квартиры или номеру парадной и этажа. 
Регистрация по номеру квартиры позволит точнее определять Ваших соседей.

⚠️Изменить номер квартиры после регистрации невозможно ⚠️'''
welcome_floor = "👋 Вы не указали квартиру. Доступные действия ⤵️"
welcome_flat = "👋 Вы указали квартиру: {}. Доступные действия ⤵️"
close_chat_link = "Перейти в закрытый чат жильцов 💬"
enter_flat_number = "Напишите пожалуйста номер Вашей квартиры в ЖК Халькон (числом)"
make_post = "Дать объявление в @Halkon_SPb 📰"
get_floor_neighbors = "Контакты соседей на этаже ↔️"
get_up_neighbors = "Контакты соседей этажом выше ⬆️"
get_down_neighbors = "Контакты соседей этажом ниже ⬇️"
get_entrance_neighbors = "Контакты соседей по парадной"
neighbors_not_found = "Соседи не найдены 🐼"
neighbors_list = "Контакты по квартирам ⤵️"
get_yk_contact = "Контакт УК"
main_menu = "Назад"
ask_for_approve = ""

