wip = "🚧 Ещё в разработке 🚧"
error = '''Печаль беда огорчение 🐼 Вы не должны были увидеть это сообщение, но оно есть. 
Это значит в боте что-то поломалось 🙈
Напишите пожалуйста об этом в закрытый чат жильцов и сообщите:
{}'''
unsuccessful = "Не получилось 🐼"
success = "Успешно 👍"
register_start = "Познакомиться 🤝"
register_by_number = "У меня квартира в ЖК Халькон 🎉"
register_by_entr_and_floor = "Регистрация по парадной и этажу"
register_commerce = "Регистрация от лица компании"
register_commerce_im_shure = "✅ Ввести название компании"
register_living_close = "Живу/работаю рядом с ЖК Халькон"
register_living_close_im_shure = "✅ Подтверждаю, что живу рядом"
register_interested = "Просто интересуюсь ЖК Халькон"
register_interested_im_shure = "✅ Верно, просто интересуюсь"
reregister_by_number = "Указать номер квартиры"
register_by_number_confirm = "✅ подтверждаю: {} на этаже: {}"
register_by_number_floor_check = "№: {} на этаже: {}"
register_by_number_cancel = "⛔️ ошибка в номере"
register_by_number_reinput = "Возможно вы ошиблись в вводе номера. Введите только номер квартиры ЖК Халькон одним числом :)"
welcome_first = '''Здравствуйте! Мы ещё не знакомы 🙈 поэтому набор доступных действий сильно ограничен 🐼
Доступные действия ⤵️'''
welcome_register = '''Отлично! Только чур будем честными 😉'''
welcome_register_flat = '''Напишите пожалуйста номер Вашей квартиры в ЖК Халькон (числом):'''
welcome_register_flat_choose_floor = '''Выберите пожалуйста правильный вариант этажа для Вашей квартиры ⤵️'''
welcome_register_flat_confirm = '''⚠️ Обратите внимание на правильность номера квартиры и этажа ⚠️

Вы указали, что Ваша квартира №{} расположена на {}-м этаже, верно? ⤵️'''
welcome_register_company = '''⚠️Изменить название компании после регистрации невозможно ⚠️

Вы регистрируетесь как представитель компании, работающей в ЖК Халькон. Верно? ⤵️'''
welcome_flat = "👋 Вы указали квартиру №{}. Доступные действия ⤵️"
welcome_commerce = '👋 Вы указали компанию "{}". Доступные действия ⤵️'
welcome_living_close = '''👋 Вы живёте рядом с нами. 
Актуальные новости публикуются в @Halkon_SPb
Доступные действия ⤵️'''
welcome_interested = '''👋 Мы рады, что вы интересуетесь нашим ЖК. 
Актуальные новости публикуются в @Halkon_SPb
Доступные действия ⤵️'''
welcome_ban = 'Собственники ЖК попросили больше не разговаривать с Вами 🙊 Доступных действий нет.'
close_chat_link = "Перейти в закрытый чат жильцов 💬"
make_advert = "Дать объявление в @Halkon_SPb 📰"
make_post = "Написать в @Halkon_SPb 💬"
todo_for_bot = "Улучшение бота 💡"
get_neighbors = "Контакты соседей 👨‍👩‍👧‍👦"
get_floor_neighbors = "Контакты соседей на этаже ↔️"
get_up_neighbors = "Контакты соседей этажом выше ⬆️"
get_down_neighbors = "Контакты соседей этажом ниже ⬇️"
get_entrance_neighbors = "Контакты соседей по парадной"
get_all_neighbors = "Контакты всех соседей в доме"
get_house_commerce = "Контакты коммерции в доме"
neighbors_not_found = "Контакты не найдены 🐼"
get_yk_contact = "Контакт УК"
main_menu = "Назад"
settings_menu = "Настройки ⚙️"
flat_id_show = "Показывать номер соседям"
flat_id_hide = "Спрятать номер от соседей"
statistics = "Сколько нас? 👀"
admin_actions = "Управление пользователями 👨‍💻"
register_approve = "+ Добавить жильца"  #/подтвердить
register_cancel = "- Удалить жильца"
register_ban = "⛔️ Забанить обманьщика"
new_neighbor = 'Новый сосед! 🎉\n{} <span class="tg-spoiler">ID {}</span>\n{}'
new_commerce = 'В боте зарегестрировался новый представитель компании <span class="tg-spoiler">ID {}</span>'
newuser_confirm = "✅ Верно"
newuser_ban = "⛔️ Неправда"
newuser_cancel = "Назад"
newuser_confirm_shure = "✅ Подтверждаю"
newuser_ban_shure = "⛔️ Блокируем"
choose_register_way_confirm = '''Для регистрации/подтверждения другого человека необходимо:
- либо переслать любое сообщение от этого человека;
- либо написать его Telegram ID (указывается в сообщении от бота в виде размытого текста).
Если не получается - напишите "нет"'''
#register_approve_confirm = "✅ продолжаем"
#register_approve_by_message = ""
