wip = "🚧 Ещё в разработке 🚧"
error = '''Печаль беда огорчение 🐼 Вы не должны были увидеть это сообщение, но оно есть. 
Это значит в боте что-то поломалось 🙈
Напишите пожалуйста об этом в закрытый чат жильцов'''
register_by_number = "Регистрация по номеру квартиры"
register_by_entr_and_floor = "Регистрация по парадной и этажу"
reregister_by_number = "Указать номер квартиры"
register_by_number_check = "Ваша квартира №{}, верно? ⤵️"
register_by_number_confirm = "Подтверждаю номер квартиры: {}"
register_by_number_cancel = "Ошибка в номере квартиры. Назад"
register_by_number_reinput = "Возможно вы ошиблись в вводе номера. Введите только номер квартиры ЖК Халькон одним числом :)"
welcome_first = '''Здравствуйте! 
Для поиска соседей нужно зарегистрироваться по номеру квартиры или номеру парадной и этажа. 
Регистрация по номеру квартиры позволит точнее определять Ваших соседей.

⚠️Изменить номер квартиры после регистрации невозможно ⚠️'''
enter_flat_number = "Напишите пожалуйста номер Вашей квартиры в ЖК Халькон (числом)"
make_post = "Дать объявление в @Halkon_SPb"
get_floor_neighbors = ""
get_up_neighbors = ""
get_down_neighbors = ""
ask_for_approve = ""
